/*
  ТЕМА: SQL. JOIN ✅
_______________________________________________________________

  Коммутативная операция - оп. обладающая свойством переместительности.

  x*y = y*x || a+b = b+a
_______________________________________________________________

  JOIN - реализация опериции соединения реляционной алегбры.

  Подтянуть данные с одной таблицы в другую.

  JOIN объеденяет таблицы по предикату.

  PK -> FK

  Операция JOIN коммутативная.
_______________________________________________________________

  Предикат - условие, по которому осущ. выборка.
_______________________________________________________________

  Заметка! Посмотреть композицию функций, каррирование.

_______________________________________________________________

  Обхе

  Типы JOIN:

  INNER JOIN - по умолчанию. Общие записи и в обеих таблицах - INTERSECT.

  { [INNER] | { LEFT | RIGHT | FULL } [OUTER] } JOIN

  Левый и правый JOINы - это не коммутативная операция.

  FULL OUTER - из левой и правой (уникальные)

  CROSS JOIN - декартово произведение

*/
